In [17]:
# Load necessary libraries
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

# Plotting pretty figures and avoid blurry images
%config InlineBackend.figure_format = 'retina'
# Larger scale for plots in notebooks
sns.set_context('talk')

# Ignore warnings
import warnings
warnings.filterwarnings('ignore')

# Enable multiple cell outputs
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

* pivot_table is an alternate to groupby
* groupby returns series
* pivot_table return dataframe

In [18]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [28]:
tips.isna().sum().sum()

0

In [19]:
# Using groupby
result = tips.groupby('sex')['total_bill'].sum()
result

sex
Male      3256.82
Female    1570.95
Name: total_bill, dtype: float64

In [20]:
type(result)

pandas.core.series.Series

In [21]:
result_pivot = tips.pivot_table(values='total_bill', index='sex', aggfunc=np.sum)
result_pivot

        total_bill
sex
Male       3256.82
Female     1570.95

In [22]:
type(result_pivot)

pandas.core.frame.DataFrame

# using groupby

In [23]:
tips.groupby(['sex', 'day'])['total_bill']\
            .agg([np.mean, np.median, np.sum]).reset_index()

      sex   day       mean  median      sum
0    Male  Thur  18.714667  16.975   561.44
1    Male   Fri  19.857000  17.215   198.57
2    Male   Sat  20.802542  18.240  1227.35
3    Male   Sun  21.887241  20.725  1269.46
4  Female  Thur  16.715312  13.785   534.89
5  Female   Fri  14.145556  15.380   127.31
6  Female   Sat  19.680357  18.360   551.05
7  Female   Sun  19.872222  17.410   357.70

# using pivot_table

In [24]:
tips.pivot_table(values='total_bill', 
                 index=['sex', 'day'], 
                 aggfunc=[np.mean, np.median, np.sum])

                  mean     median        sum
            total_bill total_bill total_bill
sex    day
Male   Thur  18.714667     16.975     561.44
       Fri   19.857000     17.215     198.57
       Sat   20.802542     18.240    1227.35
       Sun   21.887241     20.725    1269.46
Female Thur  16.715312     13.785     534.89
       Fri   14.145556     15.380     127.31
       Sat   19.680357     18.360     551.05
       Sun   19.872222     17.410     357.70

* index
* values
* aggfunc

In [25]:
pivoted = tips.pivot_table(values='total_bill', 
                           index=['sex', 'day'], 
                           aggfunc=np.median, 
                           fill_value=0)
pivoted

             total_bill
sex    day
Male   Thur      16.975
       Fri       17.215
       Sat       18.240
       Sun       20.725
Female Thur      13.785
       Fri       15.380
       Sat       18.360
       Sun       17.410

In [31]:
pivoted = tips.pivot_table(values='total_bill', 
                           index=['smoker', 'day'], 
                           aggfunc=np.median, 
                           fill_value=22220000)
pivoted

             total_bill
smoker day
Yes    Thur      16.470
       Fri       13.420
       Sat       20.390
       Sun       23.100
No     Thur      15.950
       Fri       19.235
       Sat       17.820
       Sun       18.430

* the pivot_table's fill_value parameter is not available in groupby